from PIL import Image
import re

#def test_1():
#    out1 = "./pic/2.png"
#    img = Image.open(out1)
#    width, height = img.size
#    # 设置等比例缩放后的尺寸
#    scale = 0.5
#    new_width = int(width * scale)
#    new_height = int(height * scale)
#    # 进行等比例缩放
#    img_scaled = img.resize((new_width, new_height), Image.LANCZOS)
#    # 保存缩放后的图片
#    img_scaled.save(fp="./pic/12.png")




str = "G京东首页你好，请登录免费注册我的订单我的京东京东会员丨企业采购丨客户服务网站导航手机京东网站无障碍京东超市食品搜索上海 <我的购物车0I逛超市上京东满199减100健康守护中外美酒个人护理纸品家清京东超市频道分类超市首页家庭量贩京东生鲜品牌特卖品质进口山姆会员店丨PLUS专场邮满99免运费（）100%渠道保证口京东超市京东母婴9.9周年庆价同618再返超市卡FRESH至初NEW幼儿配方奶粉(12-36月龄，3段）玩具乐器时令生鲜母婴馆清洁馆京东酒行口可企经典美味美食馆预制菜水饮馆企业超市个人护理巨超值买贵双倍赔查看更多>*南厨拉面.545包入￥54￥39￥16.9￥19.48玩具乐器中外名酒个人护理食品饮料家清纸品生鲜冷冻贝琪进阶重锤电钢琴贝琪（Betsy）电钢琴88键成人儿童便贝博氏爬行垫XPE婴儿宝宝爬爬垫双乐高（LEGO）积木得宝DUPLO1091雅马哈（YAMAHA）竖笛高音C调学携钢琴新手入门初学电子钢琴B353.面加厚家用可折叠地垫PX09A1生日..4豪华缤纷桶1.5岁+大颗粒儿童玩具..生成人初学笛子YRS-23G德式【学.￥1458¥189￥379￥39kakakUC-25D尤克里里乌克丽丽ukul雅马哈（YAMAHA）FG800VN美国奥迪双钻（AULDEY）磁力片200件套索迪儿童玩具男孩rc遥控汽车坦克可ele单板桃花心木小吉他23英寸型号实木单板初学者民谣吉他41英.创意版儿童玩具积木拼插玩具生日...发射越野四驱飘移变形赛车生日礼物¥ 429￥2029￥ 225 ￥178猜你喜欢金典洁柔幼儿酉24百岁山(12-36月齿.3段Ganten3303伊利金典纯牛奶250ml洁柔抽纸柔韧330张景田百岁山天然矿泉美素佳儿（Friso）皇*16盒/箱3.6g乳蛋...面巾纸*24包粉Face...水570ml*24瓶整箱...家幼儿配方奶粉3段.100%生牛乳韧性十足居家实用真正天然矿泉水荷兰原装进口￥59.9￥67.8￥51.9￥363OMOOMO十月稻田连续四年东北大米全国销量领先香稻atson's贡米之乡70香糯入魂质米鲁花食用油5S物理压十月稻田香稻贡米东屈臣氏（Watsons）奥妙除菌除螨酵素洗衣榨一级花生油6.09L….北大米5kg香米...苏打汽水经典原味...液18.3斤大礼包72...5S压榨色泽金黄筋糯弹牙莹润透亮0糖0脂0卡气泡充足去污去渍家庭囤货￥159.9￥99.9￥92￥119.9软葫星人無添加金龙鱼Face金龙鱼麦芯粉好奇（Huggies）软萌洁柔卷纸黑Face加厚4妈妈壹选La天然植皂金龙鱼面粉高筋粉高星人柯基裤成长裤X...层140g卫生纸巾*30...洗衣凝珠除菌洁净40..筋麦芯小麦粉5kg.…减少肌肤摩擦百分百原生木浆深层除菌去异味富有弹性精细研磨￥81￥72.9￥15.9￥24.9海之藍R佳洁士全优7效防蛀健可悠然沐浴露大黄瓶5良品铺子手撕面包2斤洋河海之蓝绵柔浓香白牙膏180g清新口...50ml美肌香氛滋润...装量贩早餐小面包..型高度白酒52度旗..对抗牙菌斑减少牙结石香氛沐浴保湿滋润清甜奶香浓进口起酥油整箱佳酿纯粮酿造￥16.5￥65.6￥21.9￥1168哈ARBINAptamil. prolutu爱他美卓萃可水洗照房纸HARBIN会贝储值儿童配方调制HARBNet wt.净含量：900爱他美(Aptamil)舒洁（Kleenex）湿厕维达（Vinda）厨房用哈尔滨牌醇爽啤酒整卓萃儿童奶粉配方调...纸家庭装80片*6包..纸可水洗卷纸75节*..箱百年传承纯正风..天然乳脂优量DHA擦去细菌水润清爽3层厚韧随心撕优选原料自嗨神器￥322￥87￥9.9￥38.78UX白猫4000gX2袋Coffem李锦记薄盐生抽1.52k中原G7三合一速溶咖白猫柠檬红茶洗洁精5力士(LUX)香氛抑菌洗g*2减盐30%原粒...啡1600g (16gx100...kg*4瓶（整箱）A类...手液莹净小苍兰香4...超值厨房组套进口品质越式风味祁门红茶香气去油祛味花香索绕抑制细菌￥35.9￥89.9￥127.6￥19.9十月稻田超值3块装全渠道累计服务1.2亿中国家庭用户Safogjard七色搭配冒燕麦片低脂粗粮Safegjard限时限量>Safegpard1件65折叠神券满99减1029欧莱雅精油润养洗发水舒肤佳香皂3块皂(纯十月稻田七色糙米 1k西麦即食燕麦片1000g护发素柔顺顺滑洗护..白+柠檬+芦荟)肥皂..g杂粮粗粮黑米红...袋冲饮谷物代餐营...滋养发丝深层滋养洗去99%细菌口感清甜软糯回甘富含膳食纤维￥105￥13.9￥29.9￥17.9人维达（Vinda）湿巾维达（Vinda）手帕纸包大人（Dr.P）基础型蜂花柔顺护发素1L小【赵丽颖推荐】湿纸【赵丽颖推荐】超韧成人纸尿裤L80片（.麦蛋白营养滋润干枯..医护级认证99.9%杀菌湿水不易破4层加厚吸收芯体贴身防漏含小麦蛋白滋养顺滑￥36.9￥10.9￥211.3￥21.5湾仔码头上汤小云吞汰渍净白去渍强效去油安佳（Anchor）高钙滴露（Dettol）洗衣消鲜美猪肉600g75只..污除菌香味持久柠檬...全脂奶粉1KG袋装..毒液衣物消毒水1.8L..鲜香味美皮薄馅大全面洁净深层去渍新西兰原装进口消毒杀菌除螨￥36.9￥39.8￥65￥189.8怡宝饮用水纯净水55京糖优级绵白糖454g美素佳儿（Friso）皇鲁花食用油物理压榨5ml*24瓶整箱装中华老字号烘焙冲...家儿童配方奶粉4段...芝麻香油（凉拌调.味道甘冽30多种营养力香味醇厚物理压榨￥30.9￥7.2￥330￥17.8品类齐全轻松购物多仓直发极速配送正品行货精致服务省天天低价畅选无忧购物指南配送方式支付方式售后服务特色服务购物流程上门自提货到付款售后政策夺宝岛会员介绍211限时达在线支付价格保护DIY装机生活旅行/团购配送服务查询分期付款退款说明延保服务常见问题配送费收取标准邮局汇款返修/退换货京东E卡大家电海外配送公司转账取消订单京东通信联系客服京东JD+关于我们丨联系我们丨联系客服合作招商丨营销中心丨手机京东丨友情链接丨销售联盟丨京东社区丨风险监测丨隐私政策丨京东公益丨EngishSite丨Media＆IR京公网安备11000002000088号丨京ICP证070359号丨互联网药品信息服务资格证编号(京）经营性-2014-0008丨新出发京零字第大120007号互联网出版许可证编号新出网证(京)字150号丨出版物经营许可证丨网络文化经营许可证京网文[20142148-348号丨违法和不良信息举报电话：4006561155Copyright2004-2023京东JD.com版权所有1消费者维权热线：4006067733经营证照京东旗下网站：京东钱包信诚信网站幸魅网"
#index = str.find("天天")
#print(index)

print(re.match(r".*?天天.*?",str))



str1 = "联想（Lenovo）23.8/27/28/29"
print(str1.replace("/",""))

print(str.count("京东"))

str2="d:/tmp/pic/jiadian/1-3-0澳乐乳OZGoodDairy乳铁  蛋白童  宝宝澳大利亚原装进口 乳铁蛋白2g*60袋.png"
print(str2.replace(" ",""))